{"backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"kernel_regularizer": null, "dtype": "float32", "trainable": true, "data_format": "channels_last", "strides": [1], "filters": 64, "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 15, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "activation": "relu", "kernel_size": [3], "name": "conv1d_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Conv1D"}, {"config": {"name": "conv1d_2", "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1], "filters": 64, "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_size": [1], "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Conv1D"}, {"config": {"name": "conv1d_3", "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1], "filters": 64, "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_size": [2], "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Conv1D"}, {"config": {"name": "conv1d_4", "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1], "filters": 64, "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_size": [2], "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Conv1D"}, {"config": {"name": "global_average_pooling1d_1", "data_format": "channels_last", "trainable": true}, "class_name": "GlobalAveragePooling1D"}, {"config": {"seed": null, "rate": 0.5, "name": "dropout_1", "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "name": "dense_1", "trainable": true, "units": 2, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.2.4"}